## Importing Necessary Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Dataframe Creation

In [17]:
# creating dataframe
df = pd.DataFrame(index = np.arange(11),columns = ['roll_number', 'name', 'gender', 'marks1', 'marks2', 'marks3'])

In [18]:
#our dataframe should be empty at this point
df

   roll_number name gender marks1 marks2 marks3
0          NaN  NaN    NaN    NaN    NaN    NaN
1          NaN  NaN    NaN    NaN    NaN    NaN
2          NaN  NaN    NaN    NaN    NaN    NaN
3          NaN  NaN    NaN    NaN    NaN    NaN
4          NaN  NaN    NaN    NaN    NaN    NaN
5          NaN  NaN    NaN    NaN    NaN    NaN
6          NaN  NaN    NaN    NaN    NaN    NaN
7          NaN  NaN    NaN    NaN    NaN    NaN
8          NaN  NaN    NaN    NaN    NaN    NaN
9          NaN  NaN    NaN    NaN    NaN    NaN
10         NaN  NaN    NaN    NaN    NaN    NaN

In [4]:
# filling roll numbers in a range and adding names
df['roll_number'] = np.arange(start=200968120,stop = 200968131,step = 1)
names = np.array(['Harsh T.','Yash V.','Yashraj S.','Kartikeya T.','Shreenidhi N.','Anandita R.','Clark K.','Tony S.','Black P.','Tom H','Cilian M.'])
df['name'] = names

In [5]:
#let us view our data frame
df

    roll_number           name gender marks1 marks2 marks3
0     200968120       Harsh T.    NaN    NaN    NaN    NaN
1     200968121        Yash V.    NaN    NaN    NaN    NaN
2     200968122     Yashraj S.    NaN    NaN    NaN    NaN
3     200968123   Kartikeya T.    NaN    NaN    NaN    NaN
4     200968124  Shreenidhi N.    NaN    NaN    NaN    NaN
5     200968125    Anandita R.    NaN    NaN    NaN    NaN
6     200968126       Clark K.    NaN    NaN    NaN    NaN
7     200968127        Tony S.    NaN    NaN    NaN    NaN
8     200968128       Black P.    NaN    NaN    NaN    NaN
9     200968129          Tom H    NaN    NaN    NaN    NaN
10    200968130      Cilian M.    NaN    NaN    NaN    NaN

In [6]:
# let us add random values for marks and gender
df['gender'] = np.array((np.random.rand(11,)*10)%2,dtype = np.int8)
df['marks1'] = np.round(np.random.rand(11,)*100,decimals=2)
df['marks2'] = np.round(np.random.rand(11,)*100,decimals=2)
df['marks3'] = np.round(np.random.rand(11,)*100,decimals=2)

In [7]:
# now our dataframe is complete and ready for calculations
df

    roll_number           name  gender  marks1  marks2  marks3
0     200968120       Harsh T.       1   62.30   75.89   59.44
1     200968121        Yash V.       0   38.83   27.42   95.51
2     200968122     Yashraj S.       1   67.71   28.33   97.37
3     200968123   Kartikeya T.       0   49.64   99.91   43.98
4     200968124  Shreenidhi N.       0   90.87   20.02   45.93
5     200968125    Anandita R.       0   73.63   50.67   48.34
6     200968126       Clark K.       1   15.38   55.01   99.11
7     200968127        Tony S.       1   95.14   57.01    0.37
8     200968128       Black P.       0   87.94    0.86   85.99
9     200968129          Tom H       0   22.53   26.02    8.37
10    200968130      Cilian M.       1   44.52   43.97   53.99

## Answering desired Questions

### Answer 1

In [8]:
# adding a new columns
df['total_marks'] = df[['marks1','marks2','marks3']].sum(axis = 1)

In [9]:
df

    roll_number           name  gender  marks1  marks2  marks3  total_marks
0     200968120       Harsh T.       1   62.30   75.89   59.44       197.63
1     200968121        Yash V.       0   38.83   27.42   95.51       161.76
2     200968122     Yashraj S.       1   67.71   28.33   97.37       193.41
3     200968123   Kartikeya T.       0   49.64   99.91   43.98       193.53
4     200968124  Shreenidhi N.       0   90.87   20.02   45.93       156.82
5     200968125    Anandita R.       0   73.63   50.67   48.34       172.64
6     200968126       Clark K.       1   15.38   55.01   99.11       169.50
7     200968127        Tony S.       1   95.14   57.01    0.37       152.52
8     200968128       Black P.       0   87.94    0.86   85.99       174.79
9     200968129          Tom H       0   22.53   26.02    8.37        56.92
10    200968130      Cilian M.       1   44.52   43.97   53.99       142.48

### Answer 2

In [10]:
#lowest marks in 1
print("Lowest Marks: ", df['marks1'].min())

Lowest Marks:  15.38

In [11]:
# student with lowest marks
print("Student with Lowest Marks: ", df[df['marks1'] == df['marks1'].min()].iloc[0,1])

Student with Lowest Marks:  Clark K.

### Answer 3

In [12]:
# highest marks in 2
print("Highest Marks in Subject 2: ",df['marks2'].max())

Highest Marks in Subject 2:  99.91

In [13]:
# student with highest marks
print("Student with Highest Marks in Subject 2: ",df[df['marks2'] == df['marks2'].min()].iloc[0,1])

Student with Highest Marks in Subject 2:  Black P.

### Answer 4

In [14]:
#average marks in 3
print("Average Marks of Subejct 3: %.2f" % df['marks3'].mean())

Average Marks of Subejct 3: 58.04

### Answer 5

In [15]:
#student with highest average
df['average'] = df['total_marks']/3
print("Student with Highest Marks: ", df[df['average'] == df['average'].max()].iloc[0,1])

Student with Highest Marks:  Harsh T.

### Answer 6

In [16]:
#number of students failing subjet 2
print("Number of Students failing subject 2: ",df[df['marks2'] < 40].shape[0])

Number of Students failing subject 2:  5